#ifndef FONT_H
#define FONT_H

#include "sh2_common.h"
#include "shared/Font/font.h"

#define FONT_STREAM_BUFFER_SIZE 0x4000

typedef struct FONT_DATA {
    // total size: 0x215B0
    /* 0x00000 */ u_int tex_head[12];                 // size 0x30
    /* 0x00030 */ u_int clut_head[12];                // size 0x30
    /* 0x00060 */ u_int clut[8];                      // size 0x20
    /* 0x00080 */ u_char texbuf[131072];              // size 0x20000
    /* 0x20080 */ u_long tex0;                        // size 0x4
    /* 0x20088 */ int fonttype;                       // size 0x4
    /* 0x2008C */ u_int rgb_u;                        // size 0x4
    /* 0x20090 */ u_int rgb_d;                        // size 0x4
    /* 0x20094 */ u_int rgb_s[4];                     // size 0x10
    /* 0x200A4 */ u_int alpha;                        // size 0x4
    /* 0x200A8 */ u_int alpha_base;                   // size 0x4
    /* 0x200AC */ u_int flag;                         // size 0x4
    /* 0x200B0 */ u_short x;                          // size 0x2
    /* 0x200B2 */ u_short y;                          // size 0x2
    /* 0x200B4 */ u_short wide_w;                     // size 0x2
    /* 0x200B6 */ u_short wide_h;                     // size 0x2
    /* 0x200B8 */ u_short right_x;                    // size 0x2
    /* 0x200BA */ u_short right_y;                    // size 0x2
    /* 0x200BC */ u_short wm;                         // size 0x2
    /* 0x200BE */ u_short hm;                         // size 0x2
    /* 0x200C0 */ short wait_count;                   // size 0x2
    /* 0x200C2 */ short wait_type;                    // size 0x2
    /* 0x200C4 */ short page_sound;                   // size 0x2
    /* 0x200C6 */ u_short code[400];                  // size 0x320
    /* 0x203E6 */ short upper[400];                   // size 0x320
    /* 0x20706 */ short lower[400];                   // size 0x320
    /* 0x20A26 */ short top;                          // size 0x2
    /* 0x20A28 */ short bottom;                       // size 0x2
    /* 0x20A2A */ short st_num;                       // size 0x2
    /* 0x20A2C */ short w_st_num;                     // size 0x2
    /* 0x20A2E */ short prl_count;                    // size 0x2
    /* 0x20A30 */ short preload;                      // size 0x2
    /* 0x20A32 */ short shadow_max;                   // size 0x2
    /* 0x20A34 */ short shadow_now;                   // size 0x2
    /* 0x20A36 */ u_short sel_xl;                     // size 0x2
    /* 0x20A38 */ u_short sel_xr;                     // size 0x2
    /* 0x20A3A */ u_short sel_yu[4];                  // size 0x8
    /* 0x20A42 */ u_short sel_yd[4];                  // size 0x8
    /* 0x20A4A */ short sel_max;                      // size 0x2
    /* 0x20A4C */ short sel_now;                      // size 0x2
    /* 0x20A4E */ u_short mes_v[MES_V_COUNT][64];     // size 0x500
    /* 0x20F50 */ u_short* mes_str_now;               // size 0x4
    /* 0x20F54 */ u_short* mes_str;                   // size 0x4
    /* 0x20F58 */ u_short* prl_str;                   // size 0x4
    /* 0x20F5C */ struct FONT_STREAM_DATA* stream;    // size 0x4
    /* 0x20F60 */ struct WFONT_STREAM_DATA* w_stream; // size 0x4
    /* 0x20F64 */ struct MFONT_STREAM_DATA* m_stream; // size 0x4
    /* 0x20F68 */ u_short stream_max;                 // size 0x2
    /* 0x20F6A */ u_short w_stream_max;               // size 0x2
    /* 0x20F6C */ u_short m_stream_max;               // size 0x2
    /* 0x20F6E */ u_short m_code[256];                // size 0x200
    /* 0x2116E */ short m_upper[256];                 // size 0x200
    /* 0x2136E */ short m_lower[256];                 // size 0x200
    /* 0x2156E */ short m_top;                        // size 0x2
    /* 0x21570 */ short m_bottom;                     // size 0x2
    /* 0x21572 */ short m_st_num;                     // size 0x2
    /* 0x21574 */ int m_base_x;                       // size 0x4
    /* 0x21578 */ int m_base_y;                       // size 0x4
    /* 0x2157C */ int m_base_z;                       // size 0x4
    /* 0x21580 */ u_int m_rgba;                       // size 0x4
    /* 0x21584 */ int m_sx;                           // size 0x4
    /* 0x21588 */ int m_sy;                           // size 0x4
    /* 0x2158C */ int m_w;                            // size 0x4
    /* 0x21590 */ int m_h;                            // size 0x4
    /* 0x21594 */ int m_x;                            // size 0x4
    /* 0x21598 */ int m_y;                            // size 0x4
    /* 0x2159C */ float bar_blink;                    // size 0x4
    /* 0x215A0 */ u_long* pCur;                       // size 0x4
    /* 0x215A4 */ int base_x;                         // size 0x4
    /* 0x215A8 */ int base_y;                         // size 0x4
    /* 0x215AC */ int base_z;                         // size 0x4
} FONT_DATA;

FONT_DATA* fontInit(void);

void fontClear(void);

void fontSetStreamMax(u_short s_max, u_short ws_max, u_short ms_max);

int fontLoad(u_short code);

void fontSet(u_short code, u_short x, u_short y);

void fontSetWide(u_short code, u_short x, u_short y, u_short w, u_short h);

void fontSetBlankBox(int x0, int x1, int y);

void fontSetLine(int x, int w, int y);

void fontPrintStr(u_short* str, int x, int y);

void fontPrintStrNum(u_short* str, u_short num, int x, int y);

u_short fontPrintStrMain(u_short** pstr, int flag);

void fontPrintDec(int num, int x, int y, int len, int flag);

void fontSetYesNo(int y);

int fontPrintWord(u_short* str, int x, int y, int align, int align2);

void fontPrintStrWide(u_short* str, int pos_x, int pos_y, int sx, int sy);

int fontGetMesWidth(int* buf, u_short* str);

void fontSetColor(int num);

void fontSetColorDirect(u_char r, u_char g, u_char b, u_char alp);

void fontSetAlpha(u_char alp);

u_long128* fontFlush(void);

u_long128* fontFlushNoSPR(void);

void fontPut(WFONT_STREAM_DATA* pstr, int z);

void fontPutSelectBar(void);

void fontPutYesNoSelectBar(void);

void* fontTexLoad(int texadr, int clutadr);

void* fontAfterEnv(void);

void fontEachTurn(void);

void fontPreload(void);

void fontSetMes(int num, u_short* str);

void fontCopyMessage(u_short* pto, u_short* pfrom);

void fontPushButton(void);

void fontPushButton2(void);

void fontSelectUp(void);

void fontSelectDown(void);

u_short* fontGetMesAdr(u_short* str, u_short num);

void fontMessageNum(u_short* str, u_short num);

void fontMessage(u_short* str);

void fontNextMessage(void);

int fontGetStatus(void);

void fontWide(u_short w, u_short h);

void fontAllCenterOn(void);

void fontAllCenterOff(void);

void fontAllCenter2On(void);

void fontAllCenter2Off(void);

void fontShadowOff(void);

void fontCrushOn(void);

void fontCrushOff(void);

void mfontClear(void);

u_long128* mfontFlush(void);

extern u_short* msg_station;
extern FONT_DATA font;
extern char font_stream_buf[FONT_STREAM_BUFFER_SIZE];

#endif
