#ifndef SH_CHARACTER_BATTLE_H
#define SH_CHARACTER_BATTLE_H

#include "common.h"
#include "Chacter/character.h"

typedef struct shBattleFight {
    // total size: 0xC
    float test_a; // offset 0x0, size 0x4
    float test_b; // offset 0x4, size 0x4
    float test_c; // offset 0x8, size 0x4
} shBattleFight;
typedef struct shBattleShot {
    // total size: 0xC
    float test_a; // offset 0x0, size 0x4
    float test_b; // offset 0x4, size 0x4
    float test_c; // offset 0x8, size 0x4
} shBattleShot;
typedef struct shAttackInfo {
    // total size: 0x24
    unsigned short id;   // offset 0x0, size 0x2
    unsigned short kind; // offset 0x2, size 0x2
    float ap;            // offset 0x4, size 0x4
    float sp;            // offset 0x8, size 0x4
    float min_range;     // offset 0xC, size 0x4
    float max_range;     // offset 0x10, size 0x4
    union {
        struct shBattleFight fight; // offset 0x0, size 0xC
        struct shBattleShot shot;   // offset 0x0, size 0xC
    } hit_check;                    // offset 0x14, size 0xC
    u_char atk_start;               // offset 0x20, size 0x1
    u_char atk_end;                 // offset 0x21, size 0x1
    u_char sd;                      // offset 0x22, size 0x1
    u_char eff;                     // offset 0x23, size 0x1
} shAttackInfo;

// total size: 0x8
typedef struct shAttackQueueOne {
    // Members
    struct SubCharacter* scp; // offset 0x0, size 0x4
    u_char wep_no;            // offset 0x4, size 0x1
    u_short atk_no;           // offset 0x6, size 0x2
} shAttackQueueOne;

// total size: 0xA4
typedef struct shAttackQueue {
    // Members
    int rest;                          // offset 0x0, size 0x4
    struct shAttackQueueOne queue[20]; // offset 0x4, size 0xA0
} shAttackQueue;

extern shAttackQueue sh2_attack_queue;
extern float sh2_battle_wall_hit;
extern int sh2_battle_attack_check;
extern shAttackInfo sh2_attack_list[66];
extern shPlayerWork sh2jms;

void shBattleAttackHitCheckInit(SubCharacter* scp /* r2 */);
void shBattleAttackHitCheckToHuman(SubCharacter* scp /* r2 */, u_short atk_no /* r2 */);
void shBattleAttackHitCheckToEnemy(SubCharacter* scp /* r2 */, u_char wep_no /* r2 */, u_short atk_no /* r2 */);
void shBattleInitAttackQueue(void);
float shBattleGetJamesHP(void);
float shBattleGetJamesHP_Rate(void);
void shBattleSetJamesDamage(u_short id /* r2 */, float damage /* r29 */, float* vec /* r2 */);
float shBattleEventWallHitCheck(void);
int shBattleCheckAttackByEnemy(void);

extern void shQzero(void*, int);

#endif
